def area (a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a, b

            Параметры:
                a (int): первая сторона прямоугольника
                b (int): вторая сторона прямоугольника

            Возвращаемое значение:
                Произведение двух сторон прямоугольника (a и b)
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a, b

            Параметры:
                a (int): первая сторона прямоугольника
                b (int): вторая сторона прямоугольника

            Возвращаемое значение:
                Удвоенная сума двух сторон прямоугольника (a и b)
    '''
    return 2 * (a + b)